# CompoundStructure Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CompoundStructure Properties
CompoundStructure Class See Also
---
The CompoundStructure type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CutoffHeight | Horizontal segments below or at the cutoff height have their distance to the wall bottom fixed, those above have their distance to the wall top fixed. |
| EndCap | Indicates the end cap condition defining which shell layers will participate in end wrapping. |
| HasStructuralDeck | Checks if the compound structure has a structural deck. |
| IsEmpty | Checks whether this CompoundStructure is empty. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| IsVerticallyCompound | Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers. |
| LayerCount | Returns the number of layers contained in this CompoundStructure. |
| MinimumSampleHeight | The minimum sample height determined by the current sample height and the horizontal segments. |
| OpeningWrapping | Indicates the opening wrapping condition defining which shell layers of a wall, in plan view, wrap at inserts and openings. |
| SampleHeight | The sample height is the presumed height of the wall to which the data in this CompoundStructure is applied. |
| StructuralMaterialIndex | Indicates the layer whose material defines the structural properties of the type for the purposes of analysis. |
| VariableLayerIndex | Indicates the index of the layer which is designated as variable. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace